modm-ext/archive-stmicro-svd/header_stm32h7b0abi6q.svd
        <register>
          <name>LUT.593</name>
          <addressOffset>0x1944</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.594</name>
          <addressOffset>0x1948</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.595</name>
          <addressOffset>0x194c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.596</name>
          <addressOffset>0x1950</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.597</name>
          <addressOffset>0x1954</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.598</name>
          <addressOffset>0x1958</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.599</name>
          <addressOffset>0x195c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.600</name>
          <addressOffset>0x1960</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.601</name>
          <addressOffset>0x1964</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.602</name>
          <addressOffset>0x1968</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.603</name>
          <addressOffset>0x196c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.604</name>
          <addressOffset>0x1970</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.605</name>
          <addressOffset>0x1974</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.606</name>
          <addressOffset>0x1978</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.607</name>
          <addressOffset>0x197c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.608</name>
          <addressOffset>0x1980</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.609</name>
          <addressOffset>0x1984</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.610</name>
          <addressOffset>0x1988</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.611</name>
          <addressOffset>0x198c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.612</name>
          <addressOffset>0x1990</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.613</name>
          <addressOffset>0x1994</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.614</name>
          <addressOffset>0x1998</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.615</name>
          <addressOffset>0x199c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.616</name>
          <addressOffset>0x19a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.617</name>
          <addressOffset>0x19a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.618</name>
          <addressOffset>0x19a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.619</name>
          <addressOffset>0x19ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.620</name>
          <addressOffset>0x19b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.621</name>
          <addressOffset>0x19b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.622</name>
          <addressOffset>0x19b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.623</name>
          <addressOffset>0x19bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.624</name>
          <addressOffset>0x19c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.625</name>
          <addressOffset>0x19c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.626</name>
          <addressOffset>0x19c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.627</name>
          <addressOffset>0x19cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.628</name>
          <addressOffset>0x19d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.629</name>
          <addressOffset>0x19d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.630</name>
          <addressOffset>0x19d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.631</name>
          <addressOffset>0x19dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.632</name>
          <addressOffset>0x19e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.633</name>
          <addressOffset>0x19e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.634</name>
          <addressOffset>0x19e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.635</name>
          <addressOffset>0x19ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.636</name>
          <addressOffset>0x19f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.637</name>
          <addressOffset>0x19f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.638</name>
          <addressOffset>0x19f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.639</name>
          <addressOffset>0x19fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.640</name>
          <addressOffset>0x1a00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.641</name>
          <addressOffset>0x1a04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.642</name>
          <addressOffset>0x1a08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.643</name>
          <addressOffset>0x1a0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.644</name>
          <addressOffset>0x1a10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.645</name>
          <addressOffset>0x1a14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.646</name>
          <addressOffset>0x1a18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.647</name>
          <addressOffset>0x1a1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.648</name>
          <addressOffset>0x1a20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.649</name>
          <addressOffset>0x1a24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.650</name>
          <addressOffset>0x1a28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.651</name>
          <addressOffset>0x1a2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.652</name>
          <addressOffset>0x1a30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.653</name>
          <addressOffset>0x1a34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.654</name>
          <addressOffset>0x1a38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.655</name>
          <addressOffset>0x1a3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.656</name>
          <addressOffset>0x1a40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.657</name>
          <addressOffset>0x1a44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.658</name>
          <addressOffset>0x1a48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.659</name>
          <addressOffset>0x1a4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.660</name>
          <addressOffset>0x1a50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.661</name>
          <addressOffset>0x1a54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.662</name>
          <addressOffset>0x1a58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.663</name>
          <addressOffset>0x1a5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.664</name>
          <addressOffset>0x1a60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.665</name>
          <addressOffset>0x1a64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.666</name>
          <addressOffset>0x1a68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.667</name>
          <addressOffset>0x1a6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.668</name>
          <addressOffset>0x1a70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.669</name>
          <addressOffset>0x1a74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.670</name>
          <addressOffset>0x1a78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.671</name>
          <addressOffset>0x1a7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.672</name>
          <addressOffset>0x1a80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.673</name>
          <addressOffset>0x1a84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.674</name>
          <addressOffset>0x1a88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.675</name>
          <addressOffset>0x1a8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.676</name>
          <addressOffset>0x1a90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.677</name>
          <addressOffset>0x1a94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.678</name>
          <addressOffset>0x1a98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.679</name>
          <addressOffset>0x1a9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.680</name>
          <addressOffset>0x1aa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.681</name>
          <addressOffset>0x1aa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.682</name>
          <addressOffset>0x1aa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.683</name>
          <addressOffset>0x1aac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.684</name>
          <addressOffset>0x1ab0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.685</name>
          <addressOffset>0x1ab4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.686</name>
          <addressOffset>0x1ab8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.687</name>
          <addressOffset>0x1abc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.688</name>
          <addressOffset>0x1ac0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.689</name>
          <addressOffset>0x1ac4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.690</name>
          <addressOffset>0x1ac8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.691</name>
          <addressOffset>0x1acc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.692</name>
          <addressOffset>0x1ad0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.693</name>
          <addressOffset>0x1ad4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.694</name>
          <addressOffset>0x1ad8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.695</name>
          <addressOffset>0x1adc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.696</name>
          <addressOffset>0x1ae0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.697</name>
          <addressOffset>0x1ae4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.698</name>
          <addressOffset>0x1ae8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.699</name>
          <addressOffset>0x1aec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.700</name>
          <addressOffset>0x1af0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.701</name>
          <addressOffset>0x1af4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.702</name>
          <addressOffset>0x1af8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.703</name>
          <addressOffset>0x1afc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.704</name>
          <addressOffset>0x1b00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.705</name>
          <addressOffset>0x1b04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.706</name>
          <addressOffset>0x1b08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.707</name>
          <addressOffset>0x1b0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.708</name>
          <addressOffset>0x1b10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.709</name>
          <addressOffset>0x1b14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.710</name>
          <addressOffset>0x1b18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.711</name>
          <addressOffset>0x1b1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.712</name>
          <addressOffset>0x1b20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.713</name>
          <addressOffset>0x1b24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.714</name>
          <addressOffset>0x1b28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.715</name>
          <addressOffset>0x1b2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.716</name>
          <addressOffset>0x1b30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.717</name>
          <addressOffset>0x1b34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.718</name>
          <addressOffset>0x1b38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.719</name>
          <addressOffset>0x1b3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.720</name>
          <addressOffset>0x1b40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.721</name>
          <addressOffset>0x1b44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.722</name>
          <addressOffset>0x1b48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.723</name>
          <addressOffset>0x1b4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.724</name>
          <addressOffset>0x1b50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.725</name>
          <addressOffset>0x1b54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.726</name>
          <addressOffset>0x1b58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.727</name>
          <addressOffset>0x1b5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.728</name>
          <addressOffset>0x1b60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.729</name>
          <addressOffset>0x1b64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.730</name>
          <addressOffset>0x1b68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.731</name>
          <addressOffset>0x1b6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.732</name>
          <addressOffset>0x1b70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.733</name>
          <addressOffset>0x1b74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.734</name>
          <addressOffset>0x1b78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.735</name>
          <addressOffset>0x1b7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.736</name>
          <addressOffset>0x1b80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.737</name>
          <addressOffset>0x1b84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.738</name>
          <addressOffset>0x1b88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.739</name>
          <addressOffset>0x1b8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.740</name>
          <addressOffset>0x1b90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.741</name>
          <addressOffset>0x1b94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.742</name>
          <addressOffset>0x1b98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.743</name>
          <addressOffset>0x1b9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.744</name>
          <addressOffset>0x1ba0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.745</name>
          <addressOffset>0x1ba4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.746</name>
          <addressOffset>0x1ba8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.747</name>
          <addressOffset>0x1bac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.748</name>
          <addressOffset>0x1bb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.749</name>
          <addressOffset>0x1bb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.750</name>
          <addressOffset>0x1bb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.751</name>
          <addressOffset>0x1bbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.752</name>
          <addressOffset>0x1bc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.753</name>
          <addressOffset>0x1bc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.754</name>
          <addressOffset>0x1bc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.755</name>
          <addressOffset>0x1bcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.756</name>
          <addressOffset>0x1bd0</addressOffset>
          <size>0x20</size>
        </register>
