modm-ext/archive-stmicro-svd/header_stm32h7b0abi6q.svd
        <register>
          <name>LUT.757</name>
          <addressOffset>0x1bd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.758</name>
          <addressOffset>0x1bd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.759</name>
          <addressOffset>0x1bdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.760</name>
          <addressOffset>0x1be0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.761</name>
          <addressOffset>0x1be4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.762</name>
          <addressOffset>0x1be8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.763</name>
          <addressOffset>0x1bec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.764</name>
          <addressOffset>0x1bf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.765</name>
          <addressOffset>0x1bf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.766</name>
          <addressOffset>0x1bf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.767</name>
          <addressOffset>0x1bfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.768</name>
          <addressOffset>0x1c00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.769</name>
          <addressOffset>0x1c04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.770</name>
          <addressOffset>0x1c08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.771</name>
          <addressOffset>0x1c0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.772</name>
          <addressOffset>0x1c10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.773</name>
          <addressOffset>0x1c14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.774</name>
          <addressOffset>0x1c18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.775</name>
          <addressOffset>0x1c1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.776</name>
          <addressOffset>0x1c20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.777</name>
          <addressOffset>0x1c24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.778</name>
          <addressOffset>0x1c28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.779</name>
          <addressOffset>0x1c2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.780</name>
          <addressOffset>0x1c30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.781</name>
          <addressOffset>0x1c34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.782</name>
          <addressOffset>0x1c38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.783</name>
          <addressOffset>0x1c3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.784</name>
          <addressOffset>0x1c40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.785</name>
          <addressOffset>0x1c44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.786</name>
          <addressOffset>0x1c48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.787</name>
          <addressOffset>0x1c4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.788</name>
          <addressOffset>0x1c50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.789</name>
          <addressOffset>0x1c54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.790</name>
          <addressOffset>0x1c58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.791</name>
          <addressOffset>0x1c5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.792</name>
          <addressOffset>0x1c60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.793</name>
          <addressOffset>0x1c64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.794</name>
          <addressOffset>0x1c68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.795</name>
          <addressOffset>0x1c6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.796</name>
          <addressOffset>0x1c70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.797</name>
          <addressOffset>0x1c74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.798</name>
          <addressOffset>0x1c78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.799</name>
          <addressOffset>0x1c7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.800</name>
          <addressOffset>0x1c80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.801</name>
          <addressOffset>0x1c84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.802</name>
          <addressOffset>0x1c88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.803</name>
          <addressOffset>0x1c8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.804</name>
          <addressOffset>0x1c90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.805</name>
          <addressOffset>0x1c94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.806</name>
          <addressOffset>0x1c98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.807</name>
          <addressOffset>0x1c9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.808</name>
          <addressOffset>0x1ca0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.809</name>
          <addressOffset>0x1ca4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.810</name>
          <addressOffset>0x1ca8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.811</name>
          <addressOffset>0x1cac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.812</name>
          <addressOffset>0x1cb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.813</name>
          <addressOffset>0x1cb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.814</name>
          <addressOffset>0x1cb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.815</name>
          <addressOffset>0x1cbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.816</name>
          <addressOffset>0x1cc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.817</name>
          <addressOffset>0x1cc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.818</name>
          <addressOffset>0x1cc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.819</name>
          <addressOffset>0x1ccc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.820</name>
          <addressOffset>0x1cd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.821</name>
          <addressOffset>0x1cd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.822</name>
          <addressOffset>0x1cd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.823</name>
          <addressOffset>0x1cdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.824</name>
          <addressOffset>0x1ce0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.825</name>
          <addressOffset>0x1ce4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.826</name>
          <addressOffset>0x1ce8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.827</name>
          <addressOffset>0x1cec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.828</name>
          <addressOffset>0x1cf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.829</name>
          <addressOffset>0x1cf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.830</name>
          <addressOffset>0x1cf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.831</name>
          <addressOffset>0x1cfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.832</name>
          <addressOffset>0x1d00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.833</name>
          <addressOffset>0x1d04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.834</name>
          <addressOffset>0x1d08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.835</name>
          <addressOffset>0x1d0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.836</name>
          <addressOffset>0x1d10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.837</name>
          <addressOffset>0x1d14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.838</name>
          <addressOffset>0x1d18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.839</name>
          <addressOffset>0x1d1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.840</name>
          <addressOffset>0x1d20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.841</name>
          <addressOffset>0x1d24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.842</name>
          <addressOffset>0x1d28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.843</name>
          <addressOffset>0x1d2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.844</name>
          <addressOffset>0x1d30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.845</name>
          <addressOffset>0x1d34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.846</name>
          <addressOffset>0x1d38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.847</name>
          <addressOffset>0x1d3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.848</name>
          <addressOffset>0x1d40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.849</name>
          <addressOffset>0x1d44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.850</name>
          <addressOffset>0x1d48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.851</name>
          <addressOffset>0x1d4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.852</name>
          <addressOffset>0x1d50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.853</name>
          <addressOffset>0x1d54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.854</name>
          <addressOffset>0x1d58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.855</name>
          <addressOffset>0x1d5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.856</name>
          <addressOffset>0x1d60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.857</name>
          <addressOffset>0x1d64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.858</name>
          <addressOffset>0x1d68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.859</name>
          <addressOffset>0x1d6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.860</name>
          <addressOffset>0x1d70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.861</name>
          <addressOffset>0x1d74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.862</name>
          <addressOffset>0x1d78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.863</name>
          <addressOffset>0x1d7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.864</name>
          <addressOffset>0x1d80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.865</name>
          <addressOffset>0x1d84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.866</name>
          <addressOffset>0x1d88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.867</name>
          <addressOffset>0x1d8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.868</name>
          <addressOffset>0x1d90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.869</name>
          <addressOffset>0x1d94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.870</name>
          <addressOffset>0x1d98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.871</name>
          <addressOffset>0x1d9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.872</name>
          <addressOffset>0x1da0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.873</name>
          <addressOffset>0x1da4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.874</name>
          <addressOffset>0x1da8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.875</name>
          <addressOffset>0x1dac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.876</name>
          <addressOffset>0x1db0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.877</name>
          <addressOffset>0x1db4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.878</name>
          <addressOffset>0x1db8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.879</name>
          <addressOffset>0x1dbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.880</name>
          <addressOffset>0x1dc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.881</name>
          <addressOffset>0x1dc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.882</name>
          <addressOffset>0x1dc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.883</name>
          <addressOffset>0x1dcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.884</name>
          <addressOffset>0x1dd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.885</name>
          <addressOffset>0x1dd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.886</name>
          <addressOffset>0x1dd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.887</name>
          <addressOffset>0x1ddc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.888</name>
          <addressOffset>0x1de0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.889</name>
          <addressOffset>0x1de4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.890</name>
          <addressOffset>0x1de8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.891</name>
          <addressOffset>0x1dec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.892</name>
          <addressOffset>0x1df0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.893</name>
          <addressOffset>0x1df4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.894</name>
          <addressOffset>0x1df8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.895</name>
          <addressOffset>0x1dfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.896</name>
          <addressOffset>0x1e00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.897</name>
          <addressOffset>0x1e04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.898</name>
          <addressOffset>0x1e08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.899</name>
          <addressOffset>0x1e0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.900</name>
          <addressOffset>0x1e10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.901</name>
          <addressOffset>0x1e14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.902</name>
          <addressOffset>0x1e18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.903</name>
          <addressOffset>0x1e1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.904</name>
          <addressOffset>0x1e20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.905</name>
          <addressOffset>0x1e24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.906</name>
          <addressOffset>0x1e28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.907</name>
          <addressOffset>0x1e2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.908</name>
          <addressOffset>0x1e30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.909</name>
          <addressOffset>0x1e34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.910</name>
          <addressOffset>0x1e38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.911</name>
          <addressOffset>0x1e3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.912</name>
          <addressOffset>0x1e40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.913</name>
          <addressOffset>0x1e44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.914</name>
          <addressOffset>0x1e48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.915</name>
          <addressOffset>0x1e4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.916</name>
          <addressOffset>0x1e50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.917</name>
          <addressOffset>0x1e54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.918</name>
          <addressOffset>0x1e58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.919</name>
          <addressOffset>0x1e5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.920</name>
          <addressOffset>0x1e60</addressOffset>
          <size>0x20</size>
        </register>
